# --------------------- Максимальное и минимальное число в списке ---------------------

# Разработать функции по поиску максимального и минимального числа в списке по модулю(abs)
# На вход список из целых чисел, на выходе целое число или None.
# Пример:
# max_abs([-100, 15, 50]) -> -100
# max_abs([-100, 15, 50]) -> 15

# Если список пустой, то вернуть None

# --------------------- Максимальное и минимальное число в списке ---------------------

def max_abs(num_list):
    pass


def min_abs(num_list):
    pass


if __name__ == "__main__":
    print(max_abs([-100, 15, 50]))
    print(min_abs([-100, 15, 50]))
    print(min_abs([]))
