# --------------------- Шифр ---------------------

# Кодируем английский алфавит маленьких букв 'a'->'z'

# Функция encode - принимает на вход строку и шифрует ее.
# Шифр по правилу:
# каждую букву мы сдвигаем на 1. 'a'->'b', ... , 'c' -> 'd', ...., 'z'->'a'
# на выходе зашифрованная строка.

# Функция decode принимает на вход зашифровонную строку и раскодирует ее.

# Пример:
# encode("apple") -> "bqqmf"
# decode("bqqmf") -> "apple"

# --------------------- Шифр ---------------------


def encode(original_str):
    pass

def decode(encoded_str):
    pass


if __name__ == "__main__":
    print(encode("apple"))
    print(decode("bqqmf"))
