# --------------------- trim ---------------------

# Реализовать функцию trim.
# На вход передается строка.
# На выходе строка без пробелов в начале и в конце.
# Пример trim("     Test  string     ") -> "Test  string"

# --------------------- trim ---------------------

def trim(str):
    pass


if __name__ == "__main__":
    print(trim("     Test  string     "))
