# --------------------- Найти всевозможные перестановки букв в слове ---------------------

# Реализовать функцию permutation(word).
# На вход слово, на выходе список из всех возможных перестановок букв в слове.

# permutation("tea") -> ["tea", "tae", "eta", "eat", "ate", "aet"]

# --------------------- Найти всевозможные перестановки букв в слове ---------------------


def permutation(word):
    pass



if __name__ == "__main__":
    print(permutation("tea"))